Catalogs/КлассификаторАлкогольнойПродукцииЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>КлассификаторАлкогольнойПродукцииЕГАИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидАлкогольнойПродукции</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Импортер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сопоставлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Упаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторУпаковки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторАлкогольнойПродукцииЕГАИС/Forms/ФормаСопоставленияУпаковок/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Номенклатура = Параметры.Номенклатура;
	УпаковкиИспользуются = Параметры.УпаковкиИспользуются;
	НаименованиеАлкогольнойПродукцииЕГАИС = Параметры.НаименованиеАлкогольнойПродукцииЕГАИС;
	ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
	
	ШаблонЗаголовка = НСтр("ru = 'Сопоставление упаковок алкогольной продукции %НаименованиеНоменклатуры%'");
	Заголовок = СтрЗаменить(ШаблонЗаголовка, "%НаименованиеНоменклатуры%", НаименованиеАлкогольнойПродукцииЕГАИС);
	
	УпаковкиКлассификатора = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище).Упаковки;
	Упаковки.Загрузить(УпаковкиКлассификатора.Выгрузить());
	
	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	
	ПеренестиВДокументСервер(Отказ);
	
	Если Не Отказ Тогда
		ОповеститьОВыборе(Новый Структура("Упаковки", АдресВХранилище));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиВДокументСервер(Отказ)
	
	АдресВХранилище = ПоместитьТаблицуВХранилище();
	
КонецПроцедуры

&НаКлиенте
Процедура УпаковкиУпаковкаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УпаковкиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УпаковкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УпаковкиУпаковкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = ИнтеграцияЕГАИСВызовСервера.ПустоеЗначениеОпределяемогоТипа("Упаковка") Тогда
		СтандартнаяОбработка = Ложь;
		
		ТекущаяСтрока = Элементы.Упаковки.ТекущиеДанные;
		ТекущаяСтрока.Упаковка = ЕдиницаИзмерения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормЕГАИСКлиентПереопределяемый.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьТаблицуВХранилище()
	
	Результат = Новый Структура("Упаковки", Упаковки);
	АдресВХранилище = ПоместитьВоВременноеХранилище(Результат, Параметры.УникальныйИдентификаторДляВременногоХранилища);
	Возврат АдресВХранилище;

КонецФункции

&НаСервере
Процедура УстановитьДоступность()
	
	Если Не ЗначениеЗаполнено(Номенклатура) 
		Или Не ПравоДоступа("Изменение", Метаданные.Справочники.КлассификаторАлкогольнойПродукцииЕГАИС) Тогда
		
		Элементы.ПеренестиВДокумент.Доступность = Ложь;
		Элементы.Упаковки.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
